{
  "navbar": {
    "link1": "Home",
    "link2": "My Skills",
    "link3": "About Me",
    "link4": "My Work"
  },
  "intro": {
    "title": "Hi, I am Gaël",
    "subtitle": "I code beautifully simple things, and I love what I do."
  },
  "skills": {
    "title": "My Skills",
    "skillTitle": "Other stuff",
    "workBtn": "My Work"
  },
  "about": {
    "title": "About Me",
    "subtitle": "I'm based in Antibes, France",
    "p1": "Back in 2022, I decided to try my hand at creating a website and tumbled head first into the rabbit hole of coding and web development. Fast-forward to today.",
    "p2": "I'm quietly confident, naturally curious, and perpetually working on improving my chops one design problem at a time.",
    "p3": "When I’m not at the computer, I’m usually cycling, scuba diving or hanging out with my wife and our two little monsters."
  },
  "work": {
    "title": "My Work",
    "subtitle": "A selection of my range of work"
  },
  "portfolio": {
    "client": "Customer",
    "presentation": "Presentation",
    "mission": "Mission",
    "title": "Technologies used"
  },
  "cards": [
    {
      "id": "0",
      "cardDescription": "Creation of a complete and responsive web application for user authentication using React and Redux.",
      "description": "This project consists of developing a complete and responsive web application for user authentication using React and Redux. The project starts with the static HTML and CSS provided for the home, login, and profile pages. The application offers the following features: users can visit the home page, log in to the system, log out, and access their profile information after successful login. The project is based on a Redux architecture to manage the overall state of the application. All necessary API routes have been prepared by the back-end team."
    },
    {
      "id": "1",
      "cardDescription": "Creation of a website for a rental agency using React and Sass.",
      "description": "Creation of a complete website for a rental agency using React.js, Sass and advanced features such as a carousel and display of owner profiles. This project provides an interactive and immersive user experience by allowing users to browse rental offers, view engaging images in carousels, and discover detailed owner profiles."
    },
    {
      "id": "2",
      "cardDescription": "Creation of an architect site with administrator management in JavaScript.",
      "description": "Creation of an architect site with administrator management in JavaScript. This project offers the architect the ability to add and remove their work via an API, facilitated by the use of Swagger. Additionally, the site is dynamically optimized to ensure a smooth user experience."
    },
    {
      "id": "3",
      "cardDescription": "Creation of a presentation of luxury restaurants using HTML, Sass and animations.",
      "description": "Created a presentation of luxury restaurants using HTML, Sass and animations. This project highlights the elegance and refined atmosphere of the establishments, thus offering an immersive visual experience."
    },
    {
      "id": "4",
      "cardDescription": "Creation of a photographer's site in HTML, CSS and JavaScript.",
      "description": "Creation of a photographer's site in HTML, CSS and JavaScript, with particular attention paid to improving performance, accessibility and SEO. This project offers a smooth user experience, easy access for everyone and optimal visibility on search engines."
    },
    {
      "id": "5",
      "cardDescription": "Completely debug and optimize the 724events website.",
      "description": "724 events is a one-page website developed for the events agency 724 events. The aim of this project was to debug and finalize the website, which had been partially integrated by a previous developer. The site is now fully functional and ready for publication. The source code has been carefully revised to resolve all issues and bugs that were hampering the visitor experience. Unit tests have been implemented to guarantee code quality and site stability."
    }
  ]
}